In [19]:
import numpy as np
import pandas as pd

df1 = pd.read_csv('C:\SemV\DAV\Day1.csv')
df2 = pd.read_csv("C:\SemV\DAV\Day2.csv")

df1, df2

(        Name Time of Joining  Duration
 0     Pranay        10:40:00        20
 1     Sharan        10:35:00        25
 2    Chandan        10:20:00        40
 3     Satyam        10:10:00        50
 4  Sudhanshu        10:30:00        30,
         Name Time of Joining  Duration
 0   Shashank        10:10:00        50
 1       Yash        10:25:00        35
 2       Sonu        10:20:00        40
 3     Satyam        10:10:00        50
 4  Sudhanshu        10:40:00        20)

In [12]:
#a
df3=pd.merge(df1,df2,how='inner',on='Name')
df3

        Name Time of Joining_x  Duration_x Time of Joining_y  Duration_y
0     Satyam          10:10:00          50          10:10:00          50
1  Sudhanshu          10:30:00          30          10:40:00          20

In [13]:
#b
df4 = pd.merge(df1,df2,how='outer',on='Name')
df4

        Name Time of Joining_x  Duration_x Time of Joining_y  Duration_y
0     Pranay          10:40:00        20.0               NaN         NaN
1     Sharan          10:35:00        25.0               NaN         NaN
2    Chandan          10:20:00        40.0               NaN         NaN
3     Satyam          10:10:00        50.0          10:10:00        50.0
4  Sudhanshu          10:30:00        30.0          10:40:00        20.0
5   Shashank               NaN         NaN          10:10:00        50.0
6       Yash               NaN         NaN          10:25:00        35.0
7       Sonu               NaN         NaN          10:20:00        40.0

In [14]:
#c
df4['Name'].count()

8

In [23]:
#d
df5 = pd.merge(dfDay1,dfDay2,how='outer',on=['Name','Duration']).copy() 
df5.fillna(value='-',inplace=True)
df5.set_index(['Name','Duration'])

                   Time of Joining_x Time of Joining_y
Name      Duration
Shashank  50                10:10:00          10:10:00
Yash      35                10:25:00          10:25:00
Sonu      40                10:20:00          10:20:00
Satyam    50                10:10:00          10:10:00
Sudhanshu 20                10:40:00          10:40:00